lvx/base/Catalogs/бит_ЭлементыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ЭлементыДанных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_СпособыКомпоновкиИсточниковДанных</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеМногоязычное</Name>
					<Comment>Наименование (на различных языках)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Comment>Источник данных</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СпособыКомпоновкиИсточниковДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Comment>Кодификатор</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидГруппы</Name>
					<Comment>Вид группы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыГруппДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПостроителя</Name>
					<Comment>Настройки построителя</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдвигНесинхронный</Name>
					<Comment>Сдвиг несинхронный</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдвигДат</Name>
					<Comment>Сдвиг дат</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдвигДатКон</Name>
					<Comment>Сдвиг дат кон</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСубконто1</Name>
					<Comment>Вид субконто1</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_2</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_4</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоБюджетирования</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_5</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_3</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСубконто2</Name>
					<Comment>Вид субконто2</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_2</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_4</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоБюджетирования</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_5</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_3</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСубконто3</Name>
					<Comment>Вид субконто3</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_2</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_4</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоБюджетирования</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_5</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_3</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСубконто4</Name>
					<Comment>Вид субконто4</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_2</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_4</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоБюджетирования</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_5</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_3</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>Коэффициент</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Comment>Формула</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОтбора</Name>
					<Comment>Представление отбора</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_Отключено</Name>
					<Comment>Отключено</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОтборВОтчете</Name>
					<Comment>Хранилище отбор в отчете</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетРасшифровка</Name>
					<Comment>Отчет расшифровка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НастройкиПроизвольныхОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформление</Name>
					<Comment>Оформление</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыводитьВОтчет</Name>
					<Comment>Не выводить в отчет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИнформационнойБазы</Name>
					<Comment>Вид информационной базы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_ВидыИнформационныхБаз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Comment>Подключение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_НастройкиВнешнихПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтрокиРасчетаДляФормулы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаРасчета</Name>
							<Comment>Строка расчета</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЭлементыДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Измерения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Comment>Путь к данным</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпособыПересчетаПоКурсам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКолонки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособПересчетаПоКурсам</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыПересчетаПоКурсам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Catalogs/бит_ЭлементыДанных/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьНастройкиПостроителя(Ссылка) Экспорт

	Результат = Неопределено; 
	Если ЗначениеЗаполнено(Ссылка) Тогда
		НастройкиПостроителя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "НастройкиПостроителя");
		Результат = НастройкиПостроителя.Получить();
	КонецЕсли; 	

	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Результат = Новый Структура(); 
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции // ПолучитьНастройкиПостроителя()

// Процедура перезаписывает элементы данных, заполняя представления отборов.
// 
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию() Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидГруппы", Перечисления.бит_ВидыГруппДанных.ВыборкаДанных);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЭлементыДанных.Ссылка КАК Ссылка,
	|	бит_ЭлементыДанных.ВидГруппы КАК ВидГруппы,
	|	бит_ЭлементыДанных.ПредставлениеОтбора КАК ПредставлениеОтбора
	|ИЗ
	|	Справочник.бит_ЭлементыДанных КАК бит_ЭлементыДанных
	|ГДЕ
	|	бит_ЭлементыДанных.ВидГруппы = &ВидГруппы
	|	И бит_ЭлементыДанных.ПредставлениеОтбора ПОДОБНО """"";
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(СпрОбъект,,Истина);
	КонецЦикла;  

КонецПроцедуры // ОбработатьДанныеДляПереходаНаНовуюВерсию()

#КонецОбласти

#КонецЕсли
